Repository: 2837269W/ned_ros
Catalog: sphinx_doc/locale/*/LC_MESSAGES/source/changelog.po
Languages: fr

source: December release - Hardware Stack refinement
fr: Release de Décembre - Refonte Stack Hardware

source: Features
fr: Fonctionnalités

source: September release - New features batch
fr: Version septembre - Nouvelles fonctionnalités

source: Tool commander package
fr: Package Tool Commander

source: TCP service settings
fr: Service de configuration du PCO

source: Arm commander package
fr: package Arm Commander

source: New movements available in ArmMoveCommand.msg
fr: Nouveaux mouvements disponibles dans ArmMoveCommand.msg

source: trajectory
fr: trajectoire

source: Python ROS Wrapper package
fr: Package Python ROS Wrapper

source: New movement functions available
fr: Nouvelles fonctions de mouvement

source: execute trajectory from pose
fr: executer une trajectoire depuis une position

source: New TCP functions available
fr: Nouvelles fonctions PCO

source: New camera settings functions available
fr: Nouvelles fonctions de configuration de la caméra

source: Improvements
fr: Améliorations

source: Refactoring Tool Commander and Robot Commander packages.
fr: Refactorisation des packages Tool Commander et Robot Commander.

source: Remove Robot Commander package
fr: Suppression du package Robot Commander

source: Reorder Robot Commander package between Tool Commander and Arm Commander packages.
fr: Redistribution du package Robot Commander entre les packages Tool Commander et Arm Commander.

source: Self collision detection
fr: Détection d'auto-collision

source: Add self-collision detection via MoveIt.
fr: Ajout de la fonction de détection d'auto-collision via MoveIt.

source: Collision detection
fr: Détection de collision

source: Collision detection improvement on each joints.
fr: Amélioration de la détection de collision du robot sur tous ses axes.

source: Learning mode activation in case of a collision.
fr: Le robot se met en Mode Apprentissage en cas de collision.
