Repository: 2837269W/ned_ros
Catalog: sphinx_doc/locale/*/LC_MESSAGES/source/real_robot.po
Languages: fr

source: Use your Niryo Robot
fr: Utiliser votre Robot Niryo

source: Every Niryo Robot is usable as is when first switched on, with Niryo Studio for instance. However this Robot can be used in many more ways if you want to go deeper into its understanding.
fr: Chaque Robot Niryo est utilisable tel quel quand il est allumé la première fois, avec Niryo Studio par exemple. Cependant, ce Robot peut être utilisé de bien d'autres manières si vous voulez plonger plus profondément dans sa compréhension.

source: In this tutorial, we will explain how the Robot is setup and the different options you have of controlling it.
fr: Dans ce tutoriel, nous allons expliquer comment le Robot est configuré et les différentes options disponibles pour le contrôler.

source: Connecting to the Robot
fr: Se connecter au Robot

source: You can connect to your robot in multiple ways (Ethernet direct, Wifi Hotspot, LAN).
fr: Vous pouvez vous connecter au robot de multiples manières différentes (Ethernet direct, hotspot wifi, LAN).

source: You can find more information on how to connect to your robot :connecting_to_the_robot:`here <>`.
fr: Vous pouvez trouver plus d'information sur comment se connecter au robot :connecting_to_the_robot:`ici <>`.

source: Once your robot is accessible from your computer, you can access it through three ways :
fr: Une foix que le robot est accessible depuis votre ordinateur, vous pouvez y accéder de trois manières différentes :

source: Niryo Studio provides you with all the tools you need to control the robot. Please refere to the :doc_niryo_studio:`Niryo Studio documentation <>` for more information.
fr: Niryo Studio vous fournit tous les outils nécessaires pour contrôler le robot. Veuillez vous réferer à la :doc_niryo_studio:`documentation Niryo Studio <>` pour plus d'information.

source: ROS implements a way to communicate between nodes launched on different machines. By indicating your computer where the Niryo Robot ROS Master Node is, you can communicate to any ROS Node as if you were directly connected on the robot. See the tutorial on the :ros_multimachine:`ROS wiki <>` for more information.
fr: ROS implémente une manière de commuiquer entre des nodes lancées sur différentes machines. En indicant à votre ordinateur où se trouve le Node Master ROS, vous pouvez communiquer avec n'importe quel Node ROS comme si vous êtiez directement connecté sur le robot. Voir le tutoriel :ros_multimachine:`ROS wiki <>` pour plus d'information.

source: Via ssh (**for advanced users only**).
fr: Via ssh (**pour les utilisateurs avancés seulement**).

source: Port 22 is open without restriction. The default user is "niryo" and its password is "robotics".
fr: Le port 22 est ouvert sans restriction d'accès. L'utilisateur par défaut est "niryo" et son mot de passe est "robotics".

source: Robot setup
fr: Organisation du robot

source: To help you understand how the OS is setup in the robot, we provide you with some insights of it.
fr: Pour vous aider à comprendre comment l'OS est installé sur le robot, nous vous indiquons quelques aperçus de son fonctionnement.

source: This document is not intended to explain how to completely install a robot from an empty SD card. It is only intended to give you clues on its architecture. Some of the installation steps are refered in :ref:`source/installation/ubuntu_18:Ubuntu 18 Installation` in case you would like to reinstall some part of it (catkin_ws for example).
fr: Ce document n'a pas pour vocation d'expliquer comment installer complètement un robot depuis une carte SD vide. Il n'est écrit que pour vous donner des pistes sur son architecture. Quelques étapes d'installation sont référencées dans :ref:`source/installation/ubuntu_18:Ubuntu 18 Installation` au cas ou vous voudriez réinstaller quelques uns de ses éléments (catkin_ws par exemple).

source: System setup
fr: Organisation du système

source: The Robot is running on top of an Ubuntu server 18.04.5 for ARM customized to work on a raspberry pi 4B It comprises all the following elements : - ROS melodic and its requirements - Sound driver - Led ring driver - Robot System services (connectivity, databases, flask server) - Basic development tools (compilation, editing tools)
fr: Le Robot tourne sur une Ubuntu server 18.04.5 pour ARM, personnalisé pour fonctionner avec une raspberry pi 4B. Il comprend tous les éléments suivants : - ROS melodic et ses prérequis - Driver de son - Driver du Led Ring - Services du système du Robot (connectivité, base de donnée, serveur flask) - Outils de développement de base (compilation, outils d'édition)

source: We took care to update and upgrade the system before sending it to you
fr: Nous avons pris soin de mettre à jour le système avant de vous l'envoyer

source: We cannot ensure that the stability of the system will be kept if you try to update your system yourself (using apt). We strongly advise you against it.
fr: Nous ne pouvons pas assurer que la stabilité du système sera conservée si vous essayez de le mettre à jour vous-même (en utilisant apt). Nous vous recommandons fortement de ne pas le faire.

source: Home setup
fr: Organisation du Home

source: The system has been configured with a default user "niryo". The core of the Robot program is installed in the home directory of niryo user */home/niryo*.
fr: Le système a été configuré avec un utilisateur par défaut "niryo". Le coeur du programme du Robot est installé dans le dossier home de l'utilisateur niryo */home/niryo*.

source: In this directory, you have:
fr: Dans ce dossier, vous avez :

source: catkin_ws : contains the source code and the compiled binary for the Niryo ROS Stack
fr: catkin_ws : contient le code source et les binaires compilés de la stack Niryo ROS

source: firmware_updater : updater for the steppers and the End Effector
fr: firmware_updater : Outil de mise à jour des moteurs Steppers et de l'End Effector

source: niryo_robot_saved_files : set of files saved on the robot, used by Niryo Studio
fr: niryo_robot_saved_files : ensemble de fichiers sauvegardés sur le robot, utilisés par Niryo Studio

source: system_software : configuration files for system wide functions
fr: system_software : fichiers de configuration pour les fonction globales du système

source: Services and daemons
fr: Services et daemons

source: Two services are used on the Robot :
fr: Deux services sont utilisés sur le Robot :

source: niryo_system_software : It launches the flask server for API communication with the robot
fr: niryo_system_software : Lance le serveur flask pour les communications API avec le robot

source: niryo_robot_ros : It launches the stack via */opt/start_ros.sh* script at startup.
fr: niryo_robot_ros ; Lance la stack avec le script */opt/start_ros.sh* au démarrage.

source: File */opt/start_ros.sh* on the ned2 robot :
fr: Fichier */opt/start_ros.sh* sur le robot Ned 2 :

source: If you want to start, stop or disable one of those services, please refer to the `dedicated manual <https://manpages.ubuntu.com/manpages/bionic/man8/service.8.html>`_.
fr: Si vous souhaitez démarrer, arrêter ou désactiver l'un de ces services, veuillez vous référer à la `documentation dédiée <https://manpages.ubuntu.com/manpages/bionic/man8/service.8.html>`_.

source: Starting the robot manually (for advanced users only)
fr: Démarrer le robot manuellement (pour les utilisateurs avancés seulement)

source: Before continuing, be sure you know what you are doing.
fr: Soyez conscient de ce que vous faites avant de continuer.

source: You will need to have a ssh access setup to continue.
fr: Vous aurez besoin d'un accès ssh pour continuer.

source: Stopping the service
fr: Arrêter le service

source: First you will need to stop the Niryo ROS Stack that is automatically started when the robot boot up. Use the system linux command to do so:
fr: Vous devez tout d'abord arrêter la stack Niryo ROS qui est automatiquement démarrée quand le robot s'allume. Utiliser la commande linux *system* pour cela :

source: Starting the robot
fr: Démarrer le robot

source: To start the robot, launch the following commands in a ssh terminal:
fr: Pour démarrer le robot, lancer les commandes suivantes dans un terminal ssh :

source: For the Ned
fr: Pour le Ned

source: For the Ned2
fr: Pour le Ned2

source: Robot launch options
fr: Options de lancement du Robot

source: Name
fr: Nom

source: Default Value
fr: Valeur par défaut

source: Log level to display for ROS loggers
fr: Niveau de log à afficher pour les loggeurs ROS

source: Enable or disable the TTL bus usage.
fr: Active ou désactive l'utilisation du port TTL.

source: This feature is used for debug mainly and can lead to an unstable stack.
fr: Cette fonctionnalité est principalement utilisée pour débugguer et peut mener à une stack instable.

source: Enable or disable the CAN bus usage.
fr: Active ou désactive l'utilisation du bus CAN.

source: Launch in debug mode. For development and debug only.
fr: Lance en mode debug. Pour du développement et du débug seulement.

source: To launch the node using timed_roslaunch.
fr: Pour lancer le noeud en utilisant timed_roslaunch.

source: If enabled, will first launch sound and light nodes to have a better user experience.
fr: Si activé, lancerra d'abord les nodes de son et de lumière pour une meilleure expérience utilisateur.

source: If disabled, the node is directly launched
fr: Si désactivé, le node sera directement lancé

source: Changing the log level
fr: Changer le niveau de log

source: Before launching the robot, you can change the configuration file for the ROS Logger in order to change the log level displayed on the terminal. This file is located in */home/niryo/catkin_ws/src/niryo_robot_bringup/config/niryo_robot_trace.conf*.
fr: Avant de lancer le robot, vous pouvez changer le fichier de configuration du Loggeur ROS afin de changer les niveaux de log affichés dans le terminal. Ce fichier est localisé dans */home/niryo/catkin_ws/src/niryo_robot_bringup/config/niryo_robot_trace.conf*.

source: It defines the logs levels for all cpp packages, based on log4cxx configuration file syntax. Please see documentation of :rosconsole:`rosconsole <>` or :log4cxx:`log4cxx <>` for more information.
fr: Il définit les niveaux de log pour tous les packages cpp, basé sur la syntaxe du fichier de configuration de log4cxx. Veuillez vous référer à la documentation de :rosconsole:`rosconsole <>` ou :log4cxx:`log4cxx <>` pour plus d'information.

source: By default, the level is set to INFO, you can change this value if you want more logs.
fr: Par défaut, le niveau est défini à INFO, vous pouvez changer cette valeur si vous voulez plus de logs.

source: DEBUG level is very verbose, you can deteriorate the performances of your robot by doing so.
fr: Le niveau DEBUG est très verbeux, vous pouvez déteriorer les performances du robot en faisant cela.

source: You can also choose to change only the log level of a specific cpp package by uncommenting one of the following lines and optionally change the associated log level.
fr: Vous pouvez aussi choisir de changer seulement les niveaux de log d'un package cpp spécifique en décommentant l'une des lignes suivantes et éventuellement changer le niveau de log associé.
